Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: $_FILES[ 'userfile']['name'][0], $_FILES['userfile']['tmp_name'][0], $_FILES['userfile']['size'][0], and $_FILES['userfile']['type'][0] are also set.
pt_br: $_FILES[ 'userfile']['name'][0], $_FILES['userfile']['tmp_name'][0], $_FILES['userfile']['size'][0], e $_FILES['userfile']['type'][0] também são definidas.

source: PUT method support
pt_br: Suporte ao método PUT

source: PUT method support has changed between PHP 3 and PHP 4.
pt_br: O suporte ao método PUT mudou entre PHP 3 e PHP 4.

source: In PHP 4, one should use the standard input stream to read the contents of an HTTP PUT.
pt_br: No PHP 4, deve se usar a entrada padrão para ler os conteúdos de um PUT.

source: Example 18-4.
pt_br: Exemplo 18-4.

source: Saving HTTP PUT files with PHP 4
pt_br: Salvando arquivos HTTP PUT com o PHP 4

source: ?php / * PUT data comes in on the stdin stream * / $putdata = fopen( "php: / /stdin" ,"r"); / * Open a file for writting * / $fp = fopen("myputfile.ext" ,"w"); / * Read the data 1kb at a time and write to the file * / while ($data = fread($putdata,1024)) fwrite($fp,$data); / * Close the streams * / fclose($fp); fclose($putdata);?
pt_br: ?php / * PUT data vem do stdin stream * / $putdata = fopen( "php: / /stdin" ,"r"); / * Abre um arquivo para escrita * / $fp = fopen("myputfile.ext" ,"w"); / * Lê os dados 1KB de cada vez e escreve no arquivo * / while ($data = fread($putdata,1024)) fwrite($fp,$data); / * Fecha os streams * / fclose($fp); fclose($putdata);?

source: All documentation below applies to PHP 3 only.
pt_br: Toda a documentação abaixo aplica-se ao PHP 3 somente.

source: PHP provides support for the HTTP PUT method used by clients such as Netscape Composer and W3C Amaya.
pt_br: PHP prove suporte para o método HTTP PUT usado por clientes como Netscape Composer e W3C Amaya.

source: PUT requests are much simpler than a file upload and they look something like this:
pt_br: Requisições PUT são muito mais simples do que o upload de arquivo e se parecem com isto:

source: This would normally mean that the remote client would like to save the content that follows as: / path / filename.html in your web tree.
pt_br: Isto normalmente indica que o cliente remoto gostaria de salvar o conteúdo que se segue como: / path / filename.html na sua arvore web.

source: It is obviously not a good idea for Apache or PHP to automatically let everybody overwrite any files in your web tree.
pt_br: É obvio que não é uma boa idéia para o Apache ou o PHP automaticamente permitir que todos possam sobrescrever arquivos na sua arvore web.

source: So, to handle such a request you have to first tell your web server that you want a certain PHP script to handle the request.
pt_br: Então, para manusear este tipo de requisição você tem primeiro que dizer ao seu servidor web que você quer que um certo script PHP cuide da requisição.

source: In Apache you do this with the Script In Apache you do this with the Script directive.
pt_br: No apache você faz isto com a diretiva Script.

source: It can be placed almost anywhere in your Apache configuration file.
pt_br: Pode ser colocada praticamente em qualquer lugar do seu arquivo de configuração do Apache.

source: A common place is inside a Directory block or perhaps inside a Virtualhost block.
pt_br: Um lugar comum é dentro de um bloco Directory ou talvez dentro de um bloco Virtualhost.

source: A line like this would do the trick:
pt_br: Uma linha como esta deve fazer o truque:

source: This tells Apache to send all PUT requests for URIs that match the context in which you put this line to the put.php script.
pt_br: Isto diz para o apache enviar todas as requisições PUT que estejam no contexto que você colocou esta linha para o script put.php.

source: This assumes, of course, that you have PHP enabled for the .php extension and PHP is active.
pt_br: Isto assume, é claro, que você tem o PHP ativado para a extensão .php e que o PHP esta ativo.

source: Inside your put.php file you would then do something like this:
pt_br: Dentro do seu arquivo put.php você deve então fazer algo parecido com isto:

source: This would copy the file to the location requested by the remote client.
pt_br: Isto deve copiar o arquivo para a localização requisitada pelo cliente remoto.

source: You would probably want to perform some checks and / or authenticate the user before performing this file copy.
pt_br: Você provavelmente quer fazer alguma checagem e / ou autenticar o usuário antes de fazer esta copia de arquivo.

source: The only trick here is that when PHP sees a PUT-method request it stores the uploaded file in a temporary file just like those handled but the POST-method.
pt_br: O único truque aqui é que quando o php vê uma requisição com o método PUT ele guarda o arquivo carregado em um arquivo temporário justo como se fosse manuseado pelo método POST.

source: When the request ends, this temporary file is deleted.
pt_br: Quando a requisição termina, este arquivo temporário é apagado.

source: So, your PUT handling PHP script has to copy that file somewhere.
pt_br: Assim seu script de manuseio do PUT tem que copiar este arquivo em outro lugar.

source: The filename of this temporary file is in the $PHP_PUT_FILENAME variable, and you can see the suggested destination filename in the $REQUEST_URI (may vary on non-Apache web servers).
pt_br: O nome deste arquivo temporário esta na variável $PHP_PUT_FILENAME, e você pode ver o nome de arquivo de destino sugerido em $REQUEST_URI (deve variar em servidores diferentes do apache).

source: This destination filename is the one that the remote client specified.
pt_br: Este nome do arquivo de destino é o que o cliente remoto especificou.

source: You do not have to listen to this client.
pt_br: Você não tem que ouvir o cliente.

source: You could, for example, copy all uploaded files to a special uploads directory.
pt_br: Você pode, por exemplo, copiar todos os arquivos carregados para um diretório especial de uploads.

source: Home
pt_br: Anterior

source: Spotting References
pt_br: Demonstrando referências

source: Example 16-1.
pt_br: Exemplo 16-1.

source: Example 16-2.
pt_br: Exemplo 16-2.

source: Features
pt_br: Características

source: See Appendix I for more information about the protocols supported by PHP.
pt_br: See Apêndice I for more information about the protocols supported by PHP.

source: The Windows versions of PHP earlier than PHP 4.3 did not support remote file accessing for the following functions: include(), include_once(), require(), require_once(), and the imagecreatefromXXX functions in the Reference XLI, Image functions extension.
pt_br: The Windows versions of PHP earlier than PHP 4.3 did not support remote file accessing for the following functions: include(), include_once(), require(), require_once(), and the imagecreatefromXXX functions in the Referência XLI, Image functions extension.

source: Example 19-1.
pt_br: Exemplo 19-1.

source: Example 19-2.
pt_br: Exemplo 19-2.

source: Chapter 22.
pt_br: Capítulo 22.

source: Safe Mode
pt_br: Próxima

source: Table 22-2.
pt_br: Tabela 22-2.

source: Checks whether the files or directories you are about to operate on have the same UID (owner) as the script that is being executed.
pt_br: Verifica se o( s) arquivo(s) e / ou diretório(s) que serão afetados por esta operação tem o mesmo UID (proprietário) do script que está sendo executado.

source: Checks whether the directory in which you are about to operate has the same UID (owner) as the script that is being executed.
pt_br: Verifica se o diretório que será afetado por esta operação tem o mesmo UID (proprietário) do script qur está sendo executado.

source: This function is disabled in safe mode.
pt_br: Esta função é desabilitada no safe-mode

source: Checks whether the directory in which you are about to operate has the same UID (owner) as the script that is being executed. (on source and target)
pt_br: Verifica se o diretório que será afetado por esta operação tem o mesmo UID (proprietário) do script qur está sendo executado. (on source and target)

source: Checks whether the directory in which you are about to operate has the same UID (owner) as the script that is being executed. (note: only the target is checked)
pt_br: Verifica se o diretório que será afetado por esta operação tem o mesmo UID (proprietário) do script qur está sendo executado. (note: only the target is checked)

source: Checks whether the directory in which you are about to operate has the same UID (owner) as the script that is being executed. (note: only affected since PHP 4.2.1)
pt_br: Verifica se o diretório que será afetado por esta operação tem o mesmo UID (proprietário) do script qur está sendo executado. (note: only affected since PHP 4.2.1)

source: Using PHP from the command line
pt_br: Utilizando o PHP na linha de comando

source: The PHP safe mode is an attempt to solve the shared-server security problem.
pt_br: Safe Mode

source: Table 22-1.
pt_br: Security and Safe Mode

source: Security and Safe Mode Configuration Directives
pt_br: Tabela 22-1.

source: Apache-specific Functions
pt_br: Apache

source: (PHP 3, PHP 4)
pt_br: abs

source: Returns the absolute value of number.
pt_br: Descrição

source: If the argument number is of type float, the return type is also float, otherwise it is integer (as float usually has a bigger value range than integer).
pt_br: Se o argumento número é do tipo float, o número retornado também é float, em outro caso será inteiro (mas poderá retornar float se o resultado tiver magnitude maior que inteiro).

source: Example 1. abs() example
pt_br: Exemplo 1. exemplo de abs()

source: $abs = abs( -4.2); / / $abs = 4.2; (double / float) $abs2 = abs(5); / / $abs2 = 5; (integer) $abs3 = abs(-5); / / $abs3 = 5; (integer)
pt_br: $abs = abs( -4.2); / / $abs = 4.2; (double / float) $abs2 = abs(5); / / $abs2 = 5; (inteiro) $abs3 = abs(-5); / / $abs3 = 5; (inteiro)

source: This function is not implemented on Windows platforms.
pt_br: Nota: esta função não é implementada na plataforma Windows

source: See also acos(), asinh() and atanh().
pt_br: Veja também acos(), asinh() e atanh().

source: Returns the arc cosine of arg in radians. acos() is the complementary function of cos(), which means that a==cos(acos(a)) for every value of a that is within acos() 'range.
pt_br: Retorna o inverso do coseno de arg em radianos. acos() é a função complementar de cos(), o que significa que a==cos(acos(a)) para qualquer valor de var que esteja dentro dos limites de acos().

source: See also acosh(), asin() and atan().
pt_br: Veja também acosh(), asin() e atan().

source: Returns a string with backslashes before characters that are listed in charlist Returns a string with backslashes before characters that are listed in charlist parameter.
pt_br: Retorna uma string com barras invertidas antes dos caracteres que estão listados no parâmetro charlist.

source: It escapes \n, \r etc. in C-like style, characters with ASCII code lower than 32 and higher than 126 are converted to octal representation.
pt_br: Como no estilo C, caracteres no código ASCII menores que 32 e maiores que 126 são convertidos para representação octadecimal.

source: Be careful if you choose to escape characters 0, a, b, f, n, r, t and v.
pt_br: Tome cuidado se você escolher escapar caracteres 0, a, b, f, n, r, t e v.

# They will be converted to 0, a, b, f, , , and v.
source: They will be converted to \0, \a, \b, \f, \n, \r, \t and \v.
pt_br: Eles serão convertidos para \0, \a, \b, \f, \n, \r, \t e \v.

source: In PHP \0 (NULL), \r (carriage return), \n (newline) and \t (tab) are predefined escape sequences, while in C all of these are predefined escape sequences.
pt_br: No PHP \0 (NULL), \r (sinal de retorno), \n (novalinha) e \t (tab) são seqüencias de escape predefinidas, enquanto em C todas essas são seqüencias de escape predefinidas.

source: charlist like "\0..\37", which would escape all characters with ASCII code between 0 and 31.
pt_br: charlist como "\0..\37", que que escaparia todos os caracteres em código ASCII entre 0 e 37.

source: Example 1. addcslashes() example
pt_br: Exemplo 1. addcslashes() exemplo

source: When you define a sequence of characters in the charlist argument make sure that you know what characters come between the characters that you set as the start and end of the range.
pt_br: Quando você define uma seqüencia de caracteres no argumento charlist certifique-se que você sabe quais os caracteres que vêm dentro do intervalo que você definiu.

source: See also stripcslashes(), stripslashes(), htmlspecialchars(), and quotemeta().
pt_br: Veja também stripcslashes(), stripslashes(), htmlspecialchars(), e quotemeta().

source: Returns a string with backslashes before characters that need to be quoted in database queries etc.
pt_br: Retorna uma string com barras invertidas antes dos caracteres que precisam estar entre aspas numa pesquisa ao banco de dados e etc.

source: These characters are single quote ('), double quote ("), backslash (\) and NUL (the NULL byte).
pt_br: Estes caracteres estão com aspas simples ('), dupla ("), barra invertida (\) e NUL (o NULL byte).

source: See also stripslashes(), htmlspecialchars(), and quotemeta().
pt_br: veja também stripslashes(), htmlspecialchars(), e quotemeta().

source: apache_child_terminate() will register the Apache process executing the current PHP request for termination once execution of PHP code it is completed.
pt_br: apache_child_terminate() apache_child_terminate() registrará o processo Apache executando a requisição atual do PHP para finalização quando a execução do código PHP terminar.

source: It may be used to terminate a process after a script with high memory consumption has been run as memory will usually only be freed internally but not given back to the operating system.
pt_br: Isto pode se utilizado para terminar um processo depois que um script que tiver um alto consumo de memória for rodado e quando essa memória normalmente só é liberada internamente, mas não é devolviva para o sistema operacional.

source: The availability of this feature is controlled by the php.ini directive apache.child_terminate, which is set to off by default.
pt_br: A disponibilidade desse recurso é controlado pela diretiva php.ini apache.child_terminate, que está definida off por default.

source: This feature is also not available on multithreaded versions of apache like the win32 version.
pt_br: Este recurso não está disponível em versões multi-thread do Apache, como a versão para Windows 32 bits.

source: See also exit().
pt_br: Veja também exit().

source: (PHP 3 = 3.0.4, PHP 4)
pt_br: apache_lookup_uri

source: This performs a partial request for a URI.
pt_br: Descrição

source: It goes just far enough to obtain all the important information about the given resource and returns this information in a class.
pt_br: Trabalha o suficiente para obter todas as informações importantes sobre o recurso dado e retorna esta informação em uma classe.

source: The properties of the returned class are:
pt_br: As propriedades da classe retornada são:

source: apache_note() is an Apache-specific function which gets and sets values in a request's notes table.
pt_br: apache_note() é uma função específica do Apache que obtém e seta valores em uma tabela de notas de requisição.

source: If called with one argument, it returns the current value of note note_name.
pt_br: Se for chamada com um argumento, ela retorna o valor atual da nota note_name.

source: If called with two arguments, it sets the value of note note_name to note_value and returns the previous value of note note_name.
pt_br: Se for chamada com dois argumentos, ela seta o valor da nota note_name para note_value e retorna o valor anterior da nota note_name.

source: apache_request_headers() returns an associative array of all the HTTP headers in the current request.
pt_br: apache_request_headers() retorna um array associativo de todos os headers HTTP da requisição atual.

source: This is only supported when PHP runs as an Apache module.
pt_br: Ela é somente suportada se o PHP roda como um módulo do Apache.

source: Prior to PHP 4.3.0, apache_request_headers() was called getallheaders().
pt_br: Antes do PHP 4.3.0, apache_request_headers() era chamado getallheaders().

source: After PHP 4.3.0, getallheaders() is an alias for apache_request_headers().
pt_br: Depois do PHP 4.3.0, getallheaders() é um sinônimo para apache_request_headers().

source: Example 1. apache_request_headers() Example
pt_br: Exemplo apache_request_headers()

source: You can also get at the value of the common CGI variables by reading them from the environment, which works whether or not you are using PHP as an Apache module.
pt_br: Você também pode obter o valor das variáveis CGI comuns lendo-as a partir do ambiente, o que funciona caso esteja ou não utilizando o PHP como módulo do Apache.

source: Use phpinfo() to see a list of all of the available environment variables.
pt_br: Faça um phpinfo() para ver uma lista dessas variáveis chamadas variáveis ambiente.

source: (PHP 4 = 4.3.0)
pt_br: apache_response_headers

source: Returns an array of all Apache response headers.
pt_br: Descrição

source: This functionality is only available in PHP version 4.3.0 and greater.
pt_br: Esta funcionalidade foi acrescentada a partir do PHP 4.3.0.

source: See also getallheaders() and headers_sent().
pt_br: Veja também getallheaders() e headers_sent().

source: Warning
pt_br: Descrição

source: (PHP 4 = 4.2.0)
pt_br: array_change_key_case

source: array_change_key_case() changes the keys in the input array to be all lowercase or uppercase.
pt_br: Descrição

source: The change depends on the last optional case The change depends on the last optional case parameter.
pt_br: A mudança depende do último parâmetro (opcional) case.

source: You can pass two constants there, CASE_UPPER and CASE_LOWER.
pt_br: Você pode passar duas constantes para ele, CASE_UPPER e CASE_LOWER.

source: The default is CASE_LOWER.
pt_br: O padrão é CASE_LOWER.

source: The function will leave number indices as is.
pt_br: Essa função deixará os índices numéricos inalterados.

source: Example 1. array_change_key_case() example
pt_br: Exemplo de array_change_key_case()

source: $input_array = array( "FirSt "= 1, "SecOnd" = 4); print_r(array_change_key_case($input_array, CASE_UPPER));
pt_br: $input_array = array( "primeiRo "= 1, "segunDo" = 4); print_r(array_change_key_case($input_array, CASE_UPPER);

source: The printout of the above program will be:
pt_br: A saída deste programa será:

source: Array ([FIRST] = 1 [SECOND] = 2)
pt_br: Array ([PRIMEIRO] = 1 [SEGUNDO] = 2)

source: Array Functions
pt_br: Funções para manipulação de arrays

source: array_chunk() splits the array into several arrays with size values in them.
pt_br: array_chunk() divide um array em diversos arrays tendo como tamanho o valor de size.

source: You may also have an array with less values at the end.
pt_br: Você provavelmente terá um array com menos valores no final.

source: You get the arrays as members of a multidimensional array indexed with numbers starting from zero.
pt_br: Serão gerados arrays como membros de um array multidimensional com índices numéricos começando de 0 (zero).

source: By setting the optional preserve_keys parameter to TRUE, you can force PHP to preserve the original keys from the input array.
pt_br: Passando o valor TRUE para o parâmetro opcional preserve_keys, pode-se forçar a preservação das chaves do array original.

source: If you specify FALSE new number indices will be used in each resulting array with indices starting from zero.
pt_br: Se for passado o valor FALSE, novos índices numéricos serão gerados em cada array resultante começando de 0 (zero).

source: The default is FALSE.
pt_br: O padrão é FALSE.

source: Example 1. array_chunk() example
pt_br: Exemplo de array_chunk()

source: Example 1. array_count_values() example
pt_br: array_count_values() retorna um array utilizando os valores do array input como chaves e seus respectivos números de ocorrências como valores.

source: $array = array (1, "hello", 1, "world", "hello"); print_r(array_count_values ($array));
pt_br: Exemplo de array_count_values()

source: Array ([1] = 2 [hello] = 2 [world] = 1)
pt_br: Array ([1] = 2 [ola] = 2 [mundo] = 1)

source: Example 1. array_diff_assoc() example
pt_br: Exemplo 1. array_diff_assoc() example

source: array_diff() returns an array containing all the values of array1 that are not present in any of the other arguments.
pt_br: array_diff() retorna um array contendo todos os valores de array1 que não estão presentes em nenhum dos outros argumentos.

source: Note that keys are preserved.
pt_br: Note que as chaves são preservadas.

source: Example 1. array_diff() example
pt_br: Exemplo de array_diff()

source: $array1 = array ("a "= "green", "red", "blue", "red"); $array2 = array ("b" = "green", "yellow", "red"); $result = array_diff ($array1, $array2);
pt_br: $array1 = array ("a "= "verde", "vermelho", "azul", "vermelho"); $array2 = array ("b" = "verde", "amarelo", "vermelho"); $result = array_diff ($array1, $array2);

source: This makes $result have array ("blue");.
pt_br: O exemplo acima faz com que $result seja array ("azul");.

source: Multiple occurrences in $array1 are all treated the same way.
pt_br: Ocorrências multiplas em $array1 são tratados da mesma forma.

source: Two elements are considered equal if and only if (string) $elem1 === (string) $elem2.
pt_br: Dois elementos são considerados iguais se, e somente se, (string) $elem1 === (string) $elem2.

source: In words: when the string representation is the same.
pt_br: Em palavras: quando a representação em string é a mesma.

source: Please note that this function only checks one dimension of a n-dimensional array.
pt_br: Note que esta função faz compara apenas uma dimensão de um array com dimensão n.

source: Of course you can check deeper dimensions by using array_diff( $array1[0], $array2[0]);.
pt_br: Mas, obviamente, você pode comparar outras dimensões usando array_diff( $array1[0], $array2[0]);.

source: This was broken in PHP 4.0.4!
pt_br: Não estava funcionando no PHP 4.0.4!

source: See also array_diff_assoc(), array_intersect() and array_intersect_assoc().
pt_br: Veja também array_intersect().

source: array_fill() fills an array with num entries of the value of the value parameter, keys starting at the start_index parameter.
pt_br: Descrição

source: Example 1. array_fill() example
pt_br: array_fill() preenche um array com o número de entradas igual a num com o valor do parâmetro value, e chaves começando a partir de start_index.

source: $a = array_fill( 5, 6, 'banana');
pt_br: Exemplo 1.

source: $a now has the following entries using print_r():
pt_br: Exemplo de array_fill()

source: Array ([5] = banana [6] = banana [7] = banana [8] = banana [9] = banana [10] = banana)
pt_br: $a = array_fill( 5, 6, 'banana'); / * $a agora tem os seguintes valores: $a[5] = "banana"; $a[6] = "banana"; $a[7] = "banana"; $a[8] = "banana"; $a[9] = "banana"; $a[10] = "banana"; * /

source: array_filter() returns an array containing all the elements of input filtered according a callback function.
pt_br: array_filter() retorna um array contendo todos os elementos do array input filtrados de acordo com uma função aplicada.

source: If the input is an associative array the keys are preserved.
pt_br: Se o array input for associativo, as chaves são preservadas.

source: Example 1. array_filter() example
pt_br: Exemplo de array_filter()
